---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.FileAccessException
source: html/d73402e6-7f45-b55e-67b5-d8d87d33684e.htm
---
# FileAccessException Methods

Retrieves data needed to serialize the target object.